#include "fan.h"
fanControl_t *fanList[FAN_NUM]= {NULL};
static void fanAdd(fanControl_t *fan);
static void fanPidInit(fanControl_t *fan);
static void getCurrentSpeed(fanControl_t *fan);
//==================================================================================================
//| 函数名称 | fanInit
//|----------|--------------------------------------------------------------------------------------
//| 函数功能 | 初始化某一个风扇参数
//|----------|--------------------------------------------------------------------------------------
//| 输入参数 | fan_实体控制句柄,*fanSetPwm_风扇PWM设置函数 ,fanSpeedMax_风扇转速最大值,fanSpeedMin_风扇转速最大值,fanPulseNum_风扇转速最小值
//|----------|--------------------------------------------------------------------------------------
//| 返回参数 | 1成功，0失败
//|----------|--------------------------------------------------------------------------------------
//| 函数设计 |
//==================================================================================================
uint8_t fanInit(fanControl_t *fan,void (*fanSetPwm),uint16_t fanSpeedMax,uint16_t fanSpeedMin,uint8_t fanPulseNum)
{
    fan->fanSetPwm=fanSetPwm;
    fan->fanSpeedMax=fanSpeedMax;
    fan->fanSpeedMin=fanSpeedMin;
    fan->fanPulseNum=fanPulseNum;
	 fan->targetSpeed=1500;
    if(fan->fanSetPwm==NULL||fanSpeedMax==fanSpeedMin)
    {
        return 0;//相关风扇控制句柄指定，初始化失败或者预设的风扇转速的最大值和最小值相等也会导致初始化失败
    }
    fanAdd(fan);//将风扇控制句柄添加至控制数组中
    fanPidInit(fan);//将风扇控制PID初始化
    return 1;
}
//==================================================================================================
//| 函数名称 | fanControlTask
//|----------|--------------------------------------------------------------------------------------
//| 函数功能 | 所有已经初始化风扇转速控制函数
//|----------|--------------------------------------------------------------------------------------
//| 输入参数 | 无
//|----------|--------------------------------------------------------------------------------------
//| 返回参数 | 无
//|----------|--------------------------------------------------------------------------------------
//| 函数设计 |
//==================================================================================================
void fanControlTask()
{
    for(int i=0; i<FAN_NUM; i++)
    {
        if(fanList[i]!=NULL)
        {
            float duty;
            if(fanList[i]->targetSpeed>fanList[i]->fanSpeedMax)
            {
                fanList[i]->targetSpeed=fanList[i]->fanSpeedMax;
            }
            if(fanList[i]->targetSpeed<fanList[i]->fanSpeedMin || fanList[i]->targetSpeed>50000)
            {
                fanList[i]->targetSpeed=fanList[i]->fanSpeedMin;
            }
			
            getCurrentSpeed(fanList[i]);//计算当前风扇转速
            duty=calPid(&fanList[i]->fanPidCore,fanList[i]->targetSpeed,fanList[i]->currentSpeed);//计算pid
            if(PWM_MODE==1)//PWM_MODE=1则当PWM为100％时转速为满
            {
				if(duty<=0)//保证最低pwm输出为死区pwm
				{
					fanList[i]->fanSetPwm(MOTOR_DEAD_ZONE);
				}
				else
				{
                    fanList[i]->fanSetPwm(duty+MOTOR_DEAD_ZONE);
				}
            }
            else
            {
				if(100.0-duty-MOTOR_DEAD_ZONE>=100-MOTOR_DEAD_ZONE)//保证最低pwm输出为死区pwm
                {
                    fanList[i]->fanSetPwm(100-MOTOR_DEAD_ZONE);
                }
				else
                {
                    fanList[i]->fanSetPwm(100.0-duty-MOTOR_DEAD_ZONE);
                }
				
            }
        }
    }
}
//==================================================================================================
//| 函数名称 | setFanFeedbackFeq
//|----------|--------------------------------------------------------------------------------------
//| 函数功能 | 获取风扇反馈信号的转速
//|----------|--------------------------------------------------------------------------------------
//| 输入参数 | *fan_风扇控制句柄,feedBackFeq_反馈信号频率
//|----------|--------------------------------------------------------------------------------------
//| 返回参数 | 无
//|----------|--------------------------------------------------------------------------------------
//| 函数设计 |
//==================================================================================================
void setFanFeedbackFeq(fanControl_t *fan,uint16_t feedBackFeq)//TODO 这里似乎可以自动化获取，无需用户手动设置
{
    fan->feedBackFeq=feedBackFeq;
}
//==================================================================================================
//| 函数名称 | fanAdd
//|----------|--------------------------------------------------------------------------------------
//| 函数功能 | 将风扇添加至控制列表
//|----------|--------------------------------------------------------------------------------------
//| 输入参数 | *fan_风扇控制句柄
//|----------|--------------------------------------------------------------------------------------
//| 返回参数 | 无
//|----------|--------------------------------------------------------------------------------------
//| 函数设计 |私有函数
//==================================================================================================
static void fanAdd(fanControl_t *fan)
{
    for(int i=0; i<FAN_NUM; i++)
    {
        if(fanList[i]==NULL)
        {
            fanList[i]=fan;
			break;
        }
    }
}
//==================================================================================================
//| 函数名称 | fanPidInit
//|----------|--------------------------------------------------------------------------------------
//| 函数功能 | 风扇转速PID控制
//|----------|--------------------------------------------------------------------------------------
//| 输入参数 | *fan_风扇控制句柄
//|----------|--------------------------------------------------------------------------------------
//| 返回参数 | 无
//|----------|--------------------------------------------------------------------------------------
//| 函数设计 |私有函数
//==================================================================================================
static void fanPidInit(fanControl_t *fan)
{
    fan->fanPidCore.f_kp = 0.00001; //比例系数
    fan->fanPidCore.f_ki = 0.00275; //积分系数
    fan->fanPidCore.f_kd =0.00005; //微分系数

    fan->fanPidCore.f_err = 0; //本次误差
    fan->fanPidCore.f_errLast = 0; //上次误差
    fan->fanPidCore.f_errPrev = 0; //上上次误差

    fan->fanPidCore.f_kpU = 0; //比例输出率
    fan->fanPidCore.f_kiU = 0; //积分输出率
    fan->fanPidCore.f_kdU = 0; //微分输出率
    fan->fanPidCore.f_kU = 0; //控制输出率
    fan->fanPidCore.f_lastKU = 0; //上次控制率

    fan->fanPidCore.f_tarVal = fan->targetSpeed; //目标值

    fan->fanPidCore.f_uLimit = 0; //控制率输出限制

    fan->fanPidCore.uin_cnt = 0;
    fan->fanPidCore.uch_flag = 1;
}
//==================================================================================================
//| 函数名称 | getCurrentSpeed
//|----------|--------------------------------------------------------------------------------------
//| 函数功能 | 获取风扇转速
//|----------|--------------------------------------------------------------------------------------
//| 输入参数 | *fan_风扇控制句柄
//|----------|--------------------------------------------------------------------------------------
//| 返回参数 | 无
//|----------|--------------------------------------------------------------------------------------
//| 函数设计 |私有函数
//==================================================================================================
static void getCurrentSpeed(fanControl_t *fan)
{
    fan->currentSpeed=60*fan->feedBackFeq/fan->fanPulseNum;
}